#### Terraform Plan for `dev` environment 🌍
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-0ad0315c4f934b704]
aws_codestarconnections_connection.github: Refreshing state... [id=arn:aws:codestar-connections:eu-central-1:288761729262:connection/9bd80c5b-bf8c-4412-ab8a-b5f9f2481bc4]
module.cicd.aws_iam_role.codepipeline: Refreshing state... [id=todo-app-dev-codepipeline-role]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:288761729262:cluster/todo-app-dev-cluster]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0adbe562223d0400e]
module.ecs.aws_cloudwatch_log_group.backend: Refreshing state... [id=/ecs/todo-app-dev-backend]
module.cicd.aws_iam_role.codebuild: Refreshing state... [id=todo-app-dev-codebuild-role]
module.cicd.data.aws_caller_identity.current: Reading...
module.cicd.aws_iam_role.codedeploy: Refreshing state... [id=todo-app-dev-codedeploy-role]
module.ecs.aws_iam_role.ecs_task_execution: Refreshing state... [id=todo-app-dev-ecs-execution-role]
module.cicd.data.aws_caller_identity.current: Read complete after 0s [id=288761729262]
module.cicd.aws_codedeploy_app.main: Refreshing state... [id=29040fe4-5e44-4248-8003-65dc1ea5e2cf:todo-app-dev-app]
module.ecr.aws_ecr_repository.repo["todo-app-dev-backend"]: Refreshing state... [id=todo-app-dev-backend]
module.ecr.aws_ecr_repository.repo["todo-app-dev-frontend"]: Refreshing state... [id=todo-app-dev-frontend]
module.ecs.aws_cloudwatch_log_group.frontend: Refreshing state... [id=/ecs/todo-app-dev-frontend]
module.documentdb.aws_docdb_cluster_parameter_group.main: Refreshing state... [id=todo-app-dev-docdb-params]
module.cicd.aws_s3_bucket.artifacts: Refreshing state... [id=todo-app-dev-artifacts-288761729262]
module.cicd.aws_iam_role_policy_attachment.codedeploy: Refreshing state... [id=todo-app-dev-codedeploy-role-20250617125231765300000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=todo-app-dev-ecs-execution-role-20250617125232112300000002]
module.ecs.aws_iam_role_policy.ecs_task_documentdb: Refreshing state... [id=todo-app-dev-ecs-execution-role:todo-app-dev-ecs-documentdb-policy]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-06d04d77e26579f66]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bb5235e60f548377]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-098d93e72270cbfa6]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-034df8464b53785e3]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c2819856251298b1]
module.ecs.aws_security_group.alb: Refreshing state... [id=sg-03d5ba541759a0471]
module.cicd.aws_lb_target_group.backend_green: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:targetgroup/todo-app-dev-backend-green-tg/6c1f58e187b6555a]
module.ecs.aws_lb_target_group.backend: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:targetgroup/todo-app-dev-backend-tg/7b695fde5c658041]
module.ecs.aws_lb_target_group.frontend: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:targetgroup/todo-app-dev-frontend-tg/6a2a0fa0575f6106]
module.cicd.aws_lb_target_group.frontend_blue: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:targetgroup/todo-app-dev-frontend-blue-tg/ef4570f0c24b05e0]
module.cicd.aws_lb_target_group.backend_blue: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:targetgroup/todo-app-dev-backend-blue-tg/2f6e06ed56a841a5]
module.cicd.aws_lb_target_group.frontend_green: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:targetgroup/todo-app-dev-frontend-green-tg/76bf7f40d900110a]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-09b0a31f489e98071]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-05691938ee78cebdf]
module.ecs.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0c6fc2758ce894ec8]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-070bad283e7555977]
module.ecs.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:loadbalancer/app/todo-app-dev-alb/c824fad94064de42]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08e4a67fbd5bfeeeb]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05e2bb3a562e7b90b]
module.documentdb.aws_docdb_subnet_group.main: Refreshing state... [id=todo-app-dev-docdb-subnet-group]
module.cicd.aws_iam_role_policy.codebuild: Refreshing state... [id=todo-app-dev-codebuild-role:terraform-20250617142424586500000001]
module.cicd.aws_s3_bucket_ownership_controls.artifacts: Refreshing state... [id=todo-app-dev-artifacts-288761729262]
module.cicd.aws_iam_role_policy.codepipeline: Refreshing state... [id=todo-app-dev-codepipeline-role:todo-app-dev-codepipeline-policy]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-057aa563217f8c666]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03e561518322961e8]
module.cicd.aws_codebuild_project.frontend: Refreshing state... [id=arn:aws:codebuild:eu-central-1:288761729262:project/todo-app-dev-frontend-build]
module.cicd.aws_codebuild_project.backend: Refreshing state... [id=arn:aws:codebuild:eu-central-1:288761729262:project/todo-app-dev-backend-build]
module.documentdb.aws_security_group.docdb: Refreshing state... [id=sg-0bdf78848780b7044]
module.cicd.aws_s3_bucket_acl.artifacts: Refreshing state... [id=todo-app-dev-artifacts-288761729262,private]
module.documentdb.aws_docdb_cluster.main: Refreshing state... [id=todo-app-dev-docdb-cluster]
module.ecs.aws_ecs_task_definition.frontend: Refreshing state... [id=todo-app-dev-frontend]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:listener/app/todo-app-dev-alb/c824fad94064de42/0abb16e83f8cae64]
module.documentdb.aws_docdb_cluster_instance.instances[0]: Refreshing state... [id=todo-app-dev-docdb-instance-0]
module.ecs.aws_ecs_task_definition.backend: Refreshing state... [id=todo-app-dev-backend]
module.ecs.aws_lb_listener_rule.backend: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:288761729262:listener-rule/app/todo-app-dev-alb/c824fad94064de42/0abb16e83f8cae64/b2fccc61206129c3]
module.ecs.aws_ecs_service.frontend: Refreshing state... [id=arn:aws:ecs:eu-central-1:288761729262:service/todo-app-dev-cluster/todo-app-dev-frontend-service]
module.ecs.aws_ecs_service.backend: Refreshing state... [id=arn:aws:ecs:eu-central-1:288761729262:service/todo-app-dev-cluster/todo-app-dev-backend-service]
module.cicd.aws_codedeploy_deployment_group.frontend: Refreshing state... [id=287c0e46-d634-4bc6-932d-4e673b10ac41]
module.cicd.aws_codedeploy_deployment_group.backend: Refreshing state... [id=9dece1ab-37fa-4fc2-9313-117d16e609e9]
module.cicd.aws_codepipeline.main: Refreshing state... [id=todo-app-dev-pipeline]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cicd.aws_codebuild_project.backend will be updated in-place
  ~ resource "aws_codebuild_project" "backend" {
        id                     = "arn:aws:codebuild:eu-central-1:288761729262:project/todo-app-dev-backend-build"
        name                   = "todo-app-dev-backend-build"
        tags                   = {}
        # (10 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = <<-EOT
              - version: 0.2
              - 
              - phases:
              -   pre_build:
              -     commands:
              -       - echo Logging in to Amazon ECR...
              -       - aws ecr get-login-password --region $AWS_DEFAULT_REGION | docker login --username AWS --password-stdin $ECR_REPOSITORY_URI
              -       - COMMIT_HASH=$(echo $CODEBUILD_RESOLVED_SOURCE_VERSION | cut -c 1-7)
              -       - IMAGE_TAG=${COMMIT_HASH:=latest}
              -       - echo Building the Docker image...
              -   build:
              -     commands:
              -       - cd backend
              -       - docker build -t $ECR_REPOSITORY_URI:$IMAGE_TAG .
              -       - docker tag $ECR_REPOSITORY_URI:$IMAGE_TAG $ECR_REPOSITORY_URI:latest
              -   post_build:
              -     commands:
              -       - echo Pushing the Docker image...
              -       - docker push $ECR_REPOSITORY_URI:$IMAGE_TAG
              -       - docker push $ECR_REPOSITORY_URI:latest
              -       - echo Writing image definitions file...
              -       - aws ecs describe-task-definition --task-definition $PROJECT_NAME-backend --query taskDefinition > taskdef.json
              -       - echo '{"version":0.0,"Resources":[{"TargetService":{"Type":"AWS::ECS::Service","Properties":{"TaskDefinition":"<TASK_DEFINITION>","LoadBalancerInfo":{"ContainerName":"'$PROJECT_NAME'-backend","ContainerPort":3000}}}}]}' > appspec.yaml
              - 
              - artifacts:
              -   files:
              -     - appspec.yaml
              -     - taskdef.json
              -   discard-paths: yes
              + buildspecs/backend-buildspec.yml
            EOT
            # (4 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.cicd.aws_codebuild_project.frontend will be updated in-place
  ~ resource "aws_codebuild_project" "frontend" {
        id                     = "arn:aws:codebuild:eu-central-1:288761729262:project/todo-app-dev-frontend-build"
        name                   = "todo-app-dev-frontend-build"
        tags                   = {}
        # (10 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = <<-EOT
              - version: 0.2
              - 
              - phases:
              -   pre_build:
              -     commands:
              -       - echo Logging in to Amazon ECR...
              -       - aws ecr get-login-password --region $AWS_DEFAULT_REGION | docker login --username AWS --password-stdin $ECR_REPOSITORY_URI
              -       - COMMIT_HASH=$(echo $CODEBUILD_RESOLVED_SOURCE_VERSION | cut -c 1-7)
              -       - IMAGE_TAG=${COMMIT_HASH:=latest}
              -       - echo Building the Docker image...
              -   build:
              -     commands:
              -       - cd frontend
              -       - docker build -t $ECR_REPOSITORY_URI:$IMAGE_TAG .
              -       - docker tag $ECR_REPOSITORY_URI:$IMAGE_TAG $ECR_REPOSITORY_URI:latest
              -   post_build:
              -     commands:
              -       - echo Pushing the Docker image...
              -       - docker push $ECR_REPOSITORY_URI:$IMAGE_TAG
              -       - docker push $ECR_REPOSITORY_URI:latest
              -       - echo Writing image definitions file...
              -       - aws ecs describe-task-definition --task-definition $PROJECT_NAME-frontend --query taskDefinition > taskdef.json
              -       - echo '{"version":0.0,"Resources":[{"TargetService":{"Type":"AWS::ECS::Service","Properties":{"TaskDefinition":"<TASK_DEFINITION>","LoadBalancerInfo":{"ContainerName":"'$PROJECT_NAME'-frontend","ContainerPort":80}}}}]}' > appspec.yaml
              - 
              - artifacts:
              -   files:
              -     - appspec.yaml
              -     - taskdef.json
              -   discard-paths: yes
              + buildspecs/frontend-buildspec.yml
            EOT
            # (4 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.cicd.aws_iam_role_policy.codebuild will be updated in-place
  ~ resource "aws_iam_role_policy" "codebuild" {
        id          = "todo-app-dev-codebuild-role:terraform-20250617142424586500000001"
        name        = "terraform-20250617142424586500000001"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action   = [
                            "codestar-connections:UseConnection",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:codestar-connections:eu-central-1:288761729262:connection/9bd80c5b-bf8c-4412-ab8a-b5f9f2481bc4"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:eu-central-1:*:parameter/*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.cicd.aws_s3_object.backend_buildspec will be created
  + resource "aws_s3_object" "backend_buildspec" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "todo-app-dev-artifacts-288761729262"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "f21d72057048b38ec8d53d70a8e5142c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "buildspecs/backend-buildspec.yml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/cicd/buildspecs/backend-buildspec.yml"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.cicd.aws_s3_object.frontend_buildspec will be created
  + resource "aws_s3_object" "frontend_buildspec" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "todo-app-dev-artifacts-288761729262"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "c7ed3eeafcc83a16e62808e7327a71f9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "buildspecs/frontend-buildspec.yml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/cicd/buildspecs/frontend-buildspec.yml"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @thekloudwiz, Action: `pull_request`*